app/Controllers/Glados.php

    public function post()
    {
        // Load the QuoteModel
        $quoteModel = new QuoteModel();

        // Fetch quotes from the database with character and character content fields
        $quotes = $quoteModel->select('character, post_content')->findAll();
---
SELECT `character`, `post_content`
FROM `quotes`